Revit 2026 API

# BoundingBoxXYZIsSet Property

---

Indicates whether the bounding box is set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSet { get; }
```
```vb
Public ReadOnly Property IsSet As Boolean
	Get
```
```cpp
public:
property bool IsSet {
	bool get ();
}
```
```fsharp
member IsSet : bool with get
```

#### Property Value

Boolean

Bounding box is considered set when it contains at least one point and "Enabled" is set to "true".

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace